Revit 2027 API
Field.KeyType Property
 The type of the keys stored in the field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Type KeyType { get; }
Public ReadOnly Property KeyType As Type
	Get
public:
property Type^ KeyType {
	Type^ get ();
}
member KeyType : Type with get
Property Value
Type
Remarks
 For key-value maps, this is the key type. For all other field, this is NULL.
See Also
Reference
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace